In [122]:
import numpy as np
import pandas as pd

## creating a dataframe

In [123]:
data={
    'names' : ["Alice", "Bob", "Carol", "David", "Emma"],
    'ages' : [28, 34, 25, 40, 30],
    'salaries' : [75000, 68000, 72000, 90000, 81000],
    'cities' : ["New York", "Los Angeles", "Chicago", "Houston", "San Francisco"]
}
data
print(type(data))

<class 'dict'>

In [124]:
labels=['a','b','c','d','e']

In [125]:
df=pd.DataFrame(data, index=labels) #now every colummn is known as series, and the output of data is dataframe, if u don't provide labels, u get serial by default

In [126]:
df

   names  ages  salaries         cities
a  Alice    28     75000       New York
b    Bob    34     68000    Los Angeles
c  Carol    25     72000        Chicago
d  David    40     90000        Houston
e   Emma    30     81000  San Francisco

In [127]:
data_list=[
    [ "Alice", 28, 75000, "New York"],
    ["Bob", 34, 68000, "Los Angeles"],
    ["Carol", 25, 72000, "Chicago"],
    ["David", 40, 90000, "Houston"],
    ["Emma", 30, 81000, "San Francisco"]
]

In [128]:
labels=['a','b','c','d','e']

In [129]:
column=['name','age','salaries','city']

In [130]:
df1=pd.DataFrame(data_list,columns=column,index=labels)

In [131]:
df1

    name  age  salaries           city
a  Alice   28     75000       New York
b    Bob   34     68000    Los Angeles
c  Carol   25     72000        Chicago
d  David   40     90000        Houston
e   Emma   30     81000  San Francisco

## selection and indexing of columns

In [132]:
df # as u saved the dataframe

   names  ages  salaries         cities
a  Alice    28     75000       New York
b    Bob    34     68000    Los Angeles
c  Carol    25     72000        Chicago
d  David    40     90000        Houston
e   Emma    30     81000  San Francisco

In [133]:
df['names'] # so we can't access serise by giving df[0], we have to give column name, [] coz of 1d

a    Alice
b      Bob
c    Carol
d    David
e     Emma
Name: names, dtype: object

In [134]:
df[['names','cities','ages']] # coz of 2d, we need to give 2[]

   names         cities  ages
a  Alice       New York    28
b    Bob    Los Angeles    34
c  Carol        Chicago    25
d  David        Houston    40
e   Emma  San Francisco    30

## creating a new column in dataframe

In [166]:
df['designation']=['doctor','engg','prof','manager','engg'] # to introduce new column in dataframe, u have to take same number of data as row contains

In [175]:
ur=df
ur

   names  ages  salaries         cities designation
a  Alice    28     75000       New York      doctor
b    Bob    34     68000    Los Angeles        engg
c  Carol    25     72000        Chicago        prof
d  David    40     90000        Houston     manager
e   Emma    30     81000  San Francisco        engg

## remove column

In [176]:
import numpy as np
import pandas as pd

In [212]:
ur

   names  ages  salaries         cities designation
a  Alice    28     75000       New York      doctor
b    Bob    34     68000    Los Angeles        engg
c  Carol    25     72000        Chicago        prof
d  David    40     90000        Houston     manager
e   Emma    30     81000  San Francisco        engg

In [213]:
ur.drop('designation', axis=1) # drop one column, coz designation passed as dtring

   names  ages  salaries         cities
a  Alice    28     75000       New York
b    Bob    34     68000    Los Angeles
c  Carol    25     72000        Chicago
d  David    40     90000        Houston
e   Emma    30     81000  San Francisco

In [214]:
ur.drop(['designation', 'ages'], axis=1) # can drop one or more column, coz here designation pass as list

   names  salaries         cities
a  Alice     75000       New York
b    Bob     68000    Los Angeles
c  Carol     72000        Chicago
d  David     90000        Houston
e   Emma     81000  San Francisco

In [200]:
df3 = pd.DataFrame({
    "name": ["Alice", "Bob", "Carol", "David"],
    "age": [25, 30, 22, 28]
})

In [201]:
df3

    name  age
0  Alice   25
1    Bob   30
2  Carol   22
3  David   28

In [202]:
df3.drop(1)  # Removes Bob, removes the row with index 1

    name  age
0  Alice   25
2  Carol   22
3  David   28

In [203]:
df3.drop([0, 2, 3])  # removes rows with index 0, 2, and 3

  name  age
1  Bob   30

In [204]:
df3.drop(2, inplace=True) #If you want to modify the original DataFrame, use this, it will remove whole row from original datagrame:

In [205]:
df3

    name  age
0  Alice   25
1    Bob   30
3  David   28

In [208]:
df3 # see after using , inplace=true, then u call that dataframe, it has already removed 2nd index row permanently
# so it will give dataframe which include 0,1,3 index, same logic apply to row also

    name  age
0  Alice   25
1    Bob   30
3  David   28

In [210]:
# ur.drop('designation', axis=1, inplace=True)
# this is for ur dataframe, after applying it, it will remove designation column, further u call ur dataframe after this code, then it will give 
#dataframe without designation column